In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_excel(r"C:\Users\Deepak kumar\Downloads\EntriesGender.xlsx")

In [4]:
df.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [5]:
df.shape

(46, 4)

In [7]:
df.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [9]:
df.describe()

           Female         Male       Total
count   46.000000    46.000000    46.00000
mean   118.086957   127.913043   246.00000
std    147.169717   166.900746   312.46134
min     10.000000     0.000000    19.00000
25%     42.750000    40.250000    85.50000
50%     90.000000    97.500000   190.00000
75%    138.750000   149.750000   288.75000
max    969.000000  1072.000000  2041.00000

In [12]:
df.columns

Index(['Discipline', 'Female', 'Male', 'Total'], dtype='object')

In [16]:
df.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [14]:
df.max()  #1. Max no. of athletes

Discipline    Wrestling
Female              969
Male               1072
Total              2041
dtype: object

In [15]:
df.min()  #1. Mix no. of athletes

Discipline    3x3 Basketball
Female                    10
Male                       0
Total                     19
dtype: object

In [27]:
df[['Male']].max()  #3. Max and min. no. of male in a particular game

Male    1072
dtype: int64

In [57]:
df[['Male']].aggregate(['min','max'])

     Male
min     0
max  1072

In [28]:
df[['Male']].min()

Male    0
dtype: int64

In [29]:
df[['Female']].max()   ##3. Max and min. no. of Female in a particular game

Female    969
dtype: int64

In [ ]:
df[['Female','Male']].aggregate(['min','max'])

In [30]:
df[['Female']].min()

Female    10
dtype: int64

In [31]:
#5. Which game is played by most of the male?

df[['Discipline','Male']].max()

Discipline    Wrestling
Male               1072
dtype: object

In [3]:
# 6. Which game is played by most of the female?

df[['Discipline','Female']].max()

NameError: name 'df' is not defined

In [56]:
# 7. Which game is only played by men?

df.loc[df['Female']==0,['Discipline','Male']]

Empty DataFrame
Columns: [Discipline, Male]
Index: []

In [55]:
#  8. Which game is only played by women?

df.loc[df['Male']==0,['Discipline','Female']]

             Discipline  Female
3     Artistic Swimming     105
28  Rhythmic Gymnastics      96

In [44]:
# 9. Which game is famous according to your data?

df[['Female','Male','Discipline']].max()

Female              969
Male               1072
Discipline    Wrestling
dtype: object

In [52]:
#10.Which game has 0 male athletes?

df.loc[df['Male']==0,'Discipline']

3       Artistic Swimming
28    Rhythmic Gymnastics
Name: Discipline, dtype: object